# Additional Project Tasks

## 1. Importing/Using Database to load data
## 2. Using Regex and Dictionary/Lists
## 3. Merging the data

### 1. Import Required Modules

In [1]:
# Import required modules
import csv
import sqlite3
import pandas as pd
import numpy as np
import math
import os
import glob

import warnings
warnings.filterwarnings("ignore")

## 2. Importing Data from Database

In [2]:
# ----------------------------------------------------------------------------------------------------
# Assignment Objective 2.1 : Your project should make use of one or more of the following: Relational
# database, API or web scraping
# I am using Relational SQLITE database already created by me using TablePlus Tool
# ----------------------------------------------------------------------------------------------------

# Read sqlite query results into a pandas DataFrame
connection = sqlite3.connect("weatherAUS.db")
df_db = pd.read_sql_query("SELECT * FROM  weatherAUS", connection)

# Verify that result of SQL query is stored in the dataframe
print(df_db.shape)

#Close the sqlite connection
connection.close()

(145460, 23)

In [3]:
#Print the dataframe information
print(df_db.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145460 entries, 0 to 145459
Data columns (total 23 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Date           145460 non-null  object
 1   Location       145460 non-null  object
 2   MinTemp        145460 non-null  object
 3   MaxTemp        145460 non-null  object
 4   Rainfall       145460 non-null  object
 5   Evaporation    145460 non-null  object
 6   Sunshine       145460 non-null  object
 7   WindGustDir    145460 non-null  object
 8   WindGustSpeed  145460 non-null  object
 9   WindDir9am     145460 non-null  object
 10  WindDir3pm     145460 non-null  object
 11  WindSpeed9am   145460 non-null  object
 12  WindSpeed3pm   145460 non-null  object
 13  Humidity9am    145460 non-null  object
 14  Humidity3pm    145460 non-null  object
 15  Pressure9am    145460 non-null  object
 16  Pressure3pm    145460 non-null  object
 17  Cloud9am       145460 non-null  object
 18  Cloud3pm       145460 non-null  object
 19  Temp9am        145460 non-null  object
 20  Temp3pm        145460 non-null  object
 21  RainToday      145460 non-null  object
 22  RainTomorrow   145460 non-null  object
dtypes: object(23)
memory usage: 25.5+ MB
None

### Using Regex and dictionary

In [4]:
import re
import requests

In [5]:
#Let's first create a Pandas dataframe with person id, name and where he/she resides

details = {'ID': [1,2,3], 
           'Name': ['X','Y','Z'], 
           'Address': ['X resides at Pincode 12345', 'Y resides at Pincode 45678','Z stays at Pincode 89765']}
# Create DataFrame
df = pd.DataFrame(details)
  
# Print the output.
df

   ID Name                     Address
0   1    X  X resides at Pincode 12345
1   2    Y  Y resides at Pincode 45678
2   3    Z    Z stays at Pincode 89765

In [6]:
# We now have the df dataframe, now we can try to find out the pincode for each person from the address

In [7]:
def find_pincode(Address):
    return re.findall('[0-9]{5}', Address)

df['Pincode'] = df['Address'].apply(find_pincode)
df

   ID Name                     Address  Pincode
0   1    X  X resides at Pincode 12345  [12345]
1   2    Y  Y resides at Pincode 45678  [45678]
2   3    Z    Z stays at Pincode 89765  [89765]

### Merging Data

In [8]:
# As part of this activity we will merge 2 csv.
# These csv are having common headers as well as 2nd csv is having an entry common to the 1st one

In [9]:
df_csv1 = pd.read_csv('csv1.csv')
df_csv1

   id   firstname  lastname                          email
0   1     Carilyn    Alisia     Carilyn.Alisia@yopmail.com
1   2  Fredericka     Tiffa   Fredericka.Tiffa@yopmail.com
2   3      Rozele   Justinn     Rozele.Justinn@yopmail.com
3   4    Jillayne  Kiersten  Jillayne.Kiersten@yopmail.com

In [10]:
df_csv2 = pd.read_csv('csv2.csv')
df_csv2

   id firstname  lastname                          email
0   1    Ofilia     Ivens       Ofilia.Ivens@yopmail.com
1   2       Cyb  Ralfston       Cyb.Ralfston@yopmail.com
2   3  Jillayne  Kiersten  Jillayne.Kiersten@yopmail.com

In [12]:
# Or we can use the glob feature to read all csv files at once
#list all csv files only beginning with csv
csv_files = glob.glob('csv*.{}'.format('csv'))
csv_files

['csv1.csv', 'csv2.csv']

In [13]:
# Let's create a new dataframe with entries from both appended
df_append = pd.DataFrame()
#append all files together
for file in csv_files:
            df_temp = pd.read_csv(file)
            df_append = df_append.append(df_temp, ignore_index=True)
df_append

   id   firstname  lastname                          email
0   1     Carilyn    Alisia     Carilyn.Alisia@yopmail.com
1   2  Fredericka     Tiffa   Fredericka.Tiffa@yopmail.com
2   3      Rozele   Justinn     Rozele.Justinn@yopmail.com
3   4    Jillayne  Kiersten  Jillayne.Kiersten@yopmail.com
4   1      Ofilia     Ivens       Ofilia.Ivens@yopmail.com
5   2         Cyb  Ralfston       Cyb.Ralfston@yopmail.com
6   3    Jillayne  Kiersten  Jillayne.Kiersten@yopmail.com

In [ ]:
# We can see that append operation has added the common row twice in the final dataframe

In [14]:
df_concat = pd.concat([pd.read_csv(f) for f in csv_files ], ignore_index=True)
df_concat

   id   firstname  lastname                          email
0   1     Carilyn    Alisia     Carilyn.Alisia@yopmail.com
1   2  Fredericka     Tiffa   Fredericka.Tiffa@yopmail.com
2   3      Rozele   Justinn     Rozele.Justinn@yopmail.com
3   4    Jillayne  Kiersten  Jillayne.Kiersten@yopmail.com
4   1      Ofilia     Ivens       Ofilia.Ivens@yopmail.com
5   2         Cyb  Ralfston       Cyb.Ralfston@yopmail.com
6   3    Jillayne  Kiersten  Jillayne.Kiersten@yopmail.com